XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
/*
 * bsp_ads127.c
 *
 *  Created on: 2020年12月4日
 *      Author: XIAOSENLUO
 */


#include "main.h"

#include "ads127.h"
#include "bsp_ads127.h"
#include "stm32l4xx_it.h"

#include "stdbool.h"

#if(1)
#define ADS_DATA_INDEX_SIZE                   (8)

#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
#if(defined(ADS_STATUS_WORD))
#define ADS_DMA_TS                            ((ADS_STATUS_WORD_EN + 3))
#endif
#endif

#if(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)
#if(defined(ADS_STATUS_WORD))
#define ADS_DMA_TS                            ((ADS_CNT * (ADS_STATUS_WORD_EN + 3)))
#endif
#endif


#ifndef ADS_TX_RX_IN_ONE
#define ADS_TX_RX_IN_ONE                      (0x01)
#endif

static uint8_t ads_rdata_comm[(ADS_CNT << 2) << 2] __attribute__((section(".ram2"))) = { 0 };     // 发送临时缓冲区
static uint8_t ads_rdata_buffer[(ADS_CNT << 2) << 2] __attribute__((section(".ram2"))) = { 0 };   // 接收临时缓冲区
static uint8_t ads_data_buffer[ADS_DATA_BUFFER_SIZE + ADS_DATA_INDEX_SIZE] __attribute__((section(".ram2"))) = { 0 };    // RAM2内存区域做缓冲区
static uint8_t ads_data_buffer2[ADS_DATA_BUFFER_SIZE + ADS_DATA_INDEX_SIZE] __attribute__((section(".data"))) = { 0 };    // 缓冲区 2
static volatile uint32_t ads_data_length __attribute__((section(".ram2"))) = 0;
static volatile uint8_t ads_index __attribute__((section(".ram2"))) = 0;

static uint8_t *data_ptr __attribute__((section(".ram2"))) = NULL;
static uint8_t *user_ptr __attribute__((section(".ram2"))) = NULL;
static volatile uint8_t ads_only_rx_fild __attribute__((section(".ram2"))) = 0;
static volatile uint8_t ads_data_ready __attribute__((section(".ram2"))) = 0;
static volatile uint32_t ads_data_index __attribute__((section(".ram2"))) = 8;
static volatile uint8_t ads_user_fild __attribute__((section(".ram2"))) = 0;
static volatile uint8_t ads_read_status __attribute__((section(".ram2"))) = 0;

static volatile uint8_t _lock = 0;

static inline void lock_buffer(void){
	_lock = 1;
}

static inline void unlock_buffer(void){
    _lock = 0;
}

static inline bool is_lock_buffer(void){
	return _lock;
}

static ads_data_t ads_data_buf = {0};
static ads_data_t ads_user_buf = {0};

static volatile struct tm ads_data_timestamp = { 0 };
extern ads_drv_t ads_drv;

ads_config_t ads_config = {.conver_rate = 2000, .osr = 32};


static volatile uint8_t ads_conver_control __attribute__((section(".ram2"))) = 0;
volatile uint32_t ads_drdy_count __attribute__((section(".ram2"))) = 0;

#if(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)
static void ads_send_rdata_command_cplt_callback(void);
static uint8_t ads_send_rdata_command(void);
#endif
static uint8_t _waitfor_spi1_alldone(void);
static uint8_t ads_start_receive_data(uint8_t *in_rx_ptr, uint16_t in_size);
static void ads_read_data_cplt_callback(void);
static void ads_data_ready_callback(void);


void ads_set_conver_rate(uint32_t rate, uint16_t osr){
	ads_config.conver_rate = rate;
	ads_config.osr = osr;
    uint32_t clk = 0;

	if((ads_config.conver_rate * ads_config.osr) <= 100000){   // 不满足最低 100KHz
		if(ads_config.conver_rate * ads_config.osr == 0){
		    clk = 0;   // 关闭采样时钟
		}else{
			clk = 128000;   // 采样主时钟  >=100KHz
		}
	}else clk = ads_config.conver_rate * ads_config.osr;

	lptim2_use_for_ads_clk(clk);    // 设置采样时钟频率

    if(ads_config.conver_rate < (clk / ads_config.osr)){  // 采样率小于最小值, 设定最小采样率, 间隔取采样值
        ads_conver_control = (clk / ads_config.osr / ads_config.conver_rate) + 1;
    }else{
    	ads_conver_control = 0;
    }

	ads_drdy_count = 0;
}


static void _ads_delay(uint32_t _delay){
	HAL_Delay(_delay);
}

void ads_drv_init(ads_write_func_t write_func, ads_read_func_t read_func, ads_write_read_func_t wr_func){

    if(write_func != NULL){
    	ads_drv.write = write_func;
    }else{
    	return;
    }
    if(read_func != NULL){
    	ads_drv.read = read_func;
    }else{
    	return;
    }
    if(wr_func != NULL){
    	ads_drv.write_read = wr_func;
    }
    ads_drv.delay = _ads_delay;
}

static uint8_t _waitfor_spi1_txcplt(void){
	uint32_t _timeout = 4000000;
	uint32_t _flag = 0;
    _flag = LL_SPI_GetTxFIFOLevel(SPI1);
    while(_flag && (_timeout--)){
    	_flag = READ_BIT(SPI1->SR, SPI_SR_FTLVL);
    }
    _flag = LL_SPI_IsActiveFlag_BSY(SPI1);
    while(_flag && (_timeout--)){
    	_flag = READ_BIT(SPI1->SR, SPI_SR_BSY);
    }
    if(_timeout) return 0;
    return 1;
}

static uint8_t _waitfor_spi1_rxcplt(void){
	uint32_t _timeout = 4000000;
	uint32_t _flag = 0;

    _flag = LL_SPI_IsActiveFlag_BSY(SPI1);
    while(_flag && (_timeout--)){
    	_flag = READ_BIT(SPI1->SR, SPI_SR_BSY);
    }
    _flag = LL_SPI_GetRxFIFOLevel(SPI1);
    while(_flag && (_timeout--)){
//    	READ_REG(*((__IO uint8_t *)&SPI1->DR));
    	_flag = READ_BIT(SPI1->SR, SPI_SR_FRLVL);
    }

    if(_timeout) return 0;
    return 1;
}

static uint8_t _waitfor_spi1_alldone(void){
	uint32_t _timeout = 4000;
	uint32_t _flag = 0;

    _flag = LL_SPI_GetTxFIFOLevel(SPI1);
    while(_flag && (_timeout--)){
    	_flag = READ_BIT(SPI1->SR, SPI_SR_FTLVL);
    }

    _flag = LL_SPI_IsActiveFlag_BSY(SPI1);
    while(_flag && (_timeout--)){
    	_flag = READ_BIT(SPI1->SR, SPI_SR_BSY);
    }
	_flag = LL_SPI_GetRxFIFOLevel(SPI1);
	while(_flag && (_timeout--)){
//    	READ_REG(*((__IO uint8_t *)&SPI1->DR));
		_flag = READ_BIT(SPI1->SR, SPI_SR_FRLVL);
	}
    if(_timeout) return 0;
    else{
		READ_REG(*((__IO uint16_t *)&SPI1->DR));
		READ_REG(*((__IO uint16_t *)&SPI1->DR));
    	return 1;
    }
}

static void ads_spi_irq_handler(void){
	uint32_t _sr = 0, _cr2 = 0;
	_sr = SPI1->SR;
	_cr2 = SPI1->CR2;

	if((_sr & SPI_SR_TXE) && (_cr2 & SPI_CR2_TXEIE)){

	}
	if(!(_sr & SPI_SR_OVR) && (_sr & SPI_SR_RXNE) && (_cr2 & SPI_CR2_RXNEIE)){

	}
	if((_cr2 & SPI_CR2_ERRIE) && ((_sr & SPI_SR_MODF) || (_sr & SPI_SR_OVR) || (_sr & SPI_SR_FRE))){
		if(_sr & SPI_SR_MODF){
			spi_internal_slave_selete(SPI1, SET);
            LL_SPI_ClearFlag_MODF(SPI1);
		}
		if(_sr & SPI_SR_OVR){
            LL_SPI_ClearFlag_OVR(SPI1);
		}
		if(_sr & SPI_SR_FRE){
            LL_SPI_ClearFlag_FRE(SPI1);
		}
	}
}

