XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
static uint8_t ads_start_receive_data(uint8_t *in_rx_ptr, uint16_t in_size){  // 接收数据使用DMA
	uint32_t ret = 0;

#if(ADS_TX_RX_IN_ONE)
    if(LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SPI1) == 0) LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);
	if(LL_SPI_IsEnabled(SPI1)) LL_SPI_Disable(SPI1);
	while(LL_SPI_GetRxFIFOLevel(SPI1)) READ_REG(*((__IO uint16_t *)&SPI1->DR));
    LL_SPI_EnableIT_ERR(SPI1);
    // RX
	if(!LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1)) LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);
	uint32_t _dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_2]);
//	NVIC_EnableIRQ(DMA1_Channel2_IRQn);

	CLEAR_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
//	LL_DMA_ClearFlag_GI2(DMA1);
//    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CPAR, LL_SPI_DMA_GetRegAddr(SPI1)); // 源地址
    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)in_rx_ptr);               // 目的地址

#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
#if(ADS_READ_DATA_IN_COMMAND)
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, (ADS_DMA_TS + 1));
#else
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, ADS_DMA_TS);
#endif
#endif
//	if(LL_DMA_GetPeriphRequest(DMA1, LL_DMA_CHANNEL_2) != LL_DMA_REQUEST_1)
//		LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_2, LL_DMA_REQUEST_1);
//    LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_2);  // RX
	SET_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
//	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CCR,
//			LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
//			LL_DMA_PRIORITY_VERYHIGH  |
//			LL_DMA_MODE_NORMAL        |
//			LL_DMA_PERIPH_NOINCREMENT |
//			LL_DMA_MEMORY_INCREMENT   |
//			LL_DMA_PDATAALIGN_BYTE    |
//			LL_DMA_MDATAALIGN_BYTE    |
//			DMA_CCR_TCIE              |
//			DMA_CCR_TEIE              |
//			DMA_CCR_EN);

	if(LL_SPI_IsEnabledDMAReq_RX(SPI1) == 0)
		LL_SPI_EnableDMAReq_RX(SPI1);

	// TX
	_dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_3]);
//	NVIC_EnableIRQ(DMA1_Channel3_IRQn);
	CLEAR_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
//	LL_DMA_ClearFlag_GI3(DMA1);
//    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CPAR, LL_SPI_DMA_GetRegAddr(SPI1)); // 目的地址
//    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)ads_rdata_comm);    // 源地址
#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
#if(ADS_READ_DATA_IN_COMMAND)
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, (ADS_DMA_TS + 1));
#else
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, ADS_DMA_TS);
#endif
#endif

//	if(LL_DMA_GetPeriphRequest(DMA1, LL_DMA_CHANNEL_3) != LL_DMA_REQUEST_1)
//		LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_3, LL_DMA_REQUEST_1);
//	LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_3); // TX
	SET_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
//	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CCR,
//			LL_DMA_DIRECTION_MEMORY_TO_PERIPH |
//			LL_DMA_PRIORITY_HIGH      |
//			LL_DMA_MODE_NORMAL        |
//			LL_DMA_PERIPH_NOINCREMENT |
//			LL_DMA_MEMORY_INCREMENT   |
//			LL_DMA_PDATAALIGN_BYTE    |
//			LL_DMA_MDATAALIGN_BYTE    |
//			DMA_CCR_TCIE              |
//			DMA_CCR_TEIE              |
//			DMA_CCR_EN);

    if(LL_SPI_IsEnabledDMAReq_TX(SPI1) == 0)
    	LL_SPI_EnableDMAReq_TX(SPI1);

    if(LL_SPI_IsEnabled(SPI1) == 0)
    	LL_SPI_Enable(SPI1);
    return ret;
#endif
}

static void ads_cpoy_data_to_buffer(uint8_t *des_ptr, uint8_t *src_ptr, uint16_t _size){
	UNUSED(des_ptr);
    uint32_t len_buf = ADS_DATA_BUFFER_SIZE + ADS_DATA_INDEX_SIZE;

    if(len_buf - ads_data_index >= _size){
        memcpy((uint8_t*)(data_ptr + ads_data_index), (uint8_t*)(src_ptr), _size);  // 复制数据到缓存
        ads_data_index += _size;
    }
    if(ads_data_index >= (len_buf)){      // 缓冲区满

    	register uint8_t *tmp_ptr = NULL;
        if(ads_user_fild){              // 用户正在读取缓冲区, 此时禁止更新缓冲区数据
#if(ADS_TIMESTAMP)
        ads_data_index = 0;
#else
        ads_data_index = 8;
#endif
        	return;
        }
        // 更新缓冲区数据
    	ads_data_length = len_buf;  // 保存数据长度
        if(ads_data_ready & ADS_DATA_BUF_FULL) ads_data_ready &= (~ADS_DATA_BUF_FULL);
        tmp_ptr = data_ptr;
        data_ptr = user_ptr;
        user_ptr = tmp_ptr;
        ads_user_buf.timestamp = ads_data_buf.timestamp;
        ads_user_buf.index = ads_data_buf.index;
#if(ADS_TIMESTAMP)
        ads_data_index = 0;
#else
        ads_data_index = 8;
#endif
        ads_data_ready |= ADS_DATA_BUF_FULL;

        return;
    }
}

static void ads_read_data_cplt_callback(void){
    uint32_t _dma_isr = 0, _dma_ie = 0;
    uint32_t _dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_2]);
    _dma_isr = DMA1->ISR;
    _dma_ie = ((DMA_Channel_TypeDef *)(_dma_ch))->CCR;

//	if(LL_DMA_IsActiveFlag_TE2(DMA1)){
	if((_dma_isr & DMA_ISR_TEIF2) && (_dma_ie & DMA_CCR_TEIE)){
		LL_DMA_ClearFlag_TE2(DMA1);
	}

#if(ADS_TX_RX_IN_ONE)
#if(ADS_RXDMA_MODE_CIRCULAR && ADS_TXDMA_MODE_CIRCULAR)
    if(_dma_isr & DMA_ISR_HTIF2){    // 数据接收一半
    	ads_bsp_selete_cs_by_index(1, RESET);
    	LL_DMA_ClearFlag_HT2(DMA1);
    }
    if(_dma_isr & DMA_ISR_HTIF3){
    	LL_DMA_ClearFlag_HT3(DMA1);
    }
#endif
//	if(LL_DMA_IsActiveFlag_TC2(DMA1)){   // RX Complete
    if((_dma_isr & DMA_ISR_TCIF2) && (_dma_ie & DMA_CCR_TCIE)){
		LL_DMA_ClearFlag_GI2(DMA1);
		ads_index += 1;
#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
        // 读取第二个通道
		if(ads_index < ADS_CNT){
			_waitfor_spi1_rxcplt();
			LL_SPI_DisableDMAReq_RX(SPI1);
			LL_SPI_Disable(SPI1);
			ads_bsp_selete_cs_by_index(ads_index);
#if(ADS_READ_DATA_IN_COMMAND)
		    ads_start_receive_data(&ads_rdata_buffer[ADS_DMA_TS + 1], (ADS_DMA_TS));
#else
		    ads_start_receive_data(&ads_rdata_buffer[ADS_DMA_TS], (ADS_DMA_TS));
#endif
		}
		if(ads_index == ADS_CNT){   // 所有通道读取完成
			ads_index = 0;
			LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_2);
			LL_SPI_DisableDMAReq_RX(SPI1);
			_waitfor_spi1_alldone();
			LL_SPI_Disable(SPI1);
			LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SPI1);    // 关闭SPI时钟
			LL_AHB1_GRP1_DisableClock(LL_AHB1_GRP1_PERIPH_DMA1); // 关闭DMA1时钟
			ads_read_status &= (~ADS_READING);
			ads_read_status |= (ADS_READ_COMPLETE);

