XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
#if(ADS_READ_DATA_IN_COMMAND)
#if(ADS_TIMESTAMP)
			ads_cpoy_data_to_buffer((uint8_t*)data_ptr, &ads_rdata_buffer[1], ADS_DMA_TS);     // 复制数据到缓冲区
			ads_cpoy_data_to_buffer((uint8_t*)data_ptr, &ads_rdata_buffer[ADS_DMA_TS + 2], ADS_DMA_TS);
#else
			ads_cpoy_data_to_buffer((uint8_t*)&data_ptr[ADS_DATA_INDEX_SIZE], &ads_rdata_buffer[1], ADS_DMA_TS);     // 复制数据到缓冲区
			ads_cpoy_data_to_buffer((uint8_t*)&data_ptr[ADS_DATA_INDEX_SIZE], &ads_rdata_buffer[ADS_DMA_TS + 2], ADS_DMA_TS);
#endif
#else
#if(ADS_TIMESTAMP)
			ads_cpoy_data_to_buffer((uint8_t*)data_ptr, ads_rdata_buffer, ADS_DMA_TS << 1);     // 复制数据到缓冲区
#else

			ads_cpoy_data_to_buffer((uint8_t*)&data_ptr[ADS_DATA_INDEX_SIZE], ads_rdata_buffer, ADS_DMA_TS << 1);     // 复制数据到缓冲区
#endif
#endif
//		    ads_drdy_exti_enable();
		}
#elif(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)

#endif
	}
#endif
}

#if(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)

static uint8_t ads_send_rdata_command(void){      // 发送一个命令
	uint32_t ret = 0;
	uint32_t _timeout = 4000000;
	if(LL_SPI_IsEnabledDMAReq_RX(SPI1)) LL_SPI_DisableDMAReq_RX(SPI1);
	if(LL_SPI_IsEnabledDMAReq_TX(SPI1)) LL_SPI_DisableDMAReq_TX(SPI1);
	ret = LL_SPI_GetTxFIFOLevel(SPI1);
    while((ret) && (_timeout--)){      // 还有数据帧未处理
    	ret = READ_BIT(SPI1->SR, SPI_SR_FTLVL);
    }
	ret = LL_SPI_IsActiveFlag_BSY(SPI1);
    while((ret) && (_timeout--)){      // 还有数据帧未处理
    	ret = READ_BIT(SPI1->SR, SPI_SR_BSY);
    }
    if(!_timeout) return 1;
    if(LL_SPI_IsEnabled(SPI1)) LL_SPI_Disable(SPI1);             // 终止
    LL_SPI_SetTransferDirection(SPI1, LL_SPI_FULL_DUPLEX);
    LL_SPI_SetDataWidth(SPI1, LL_SPI_DATAWIDTH_8BIT);
    LL_SPI_SetRxFIFOThreshold(SPI1, LL_SPI_RX_FIFO_TH_QUARTER);         // 8bit
    LL_SPI_TransmitData8(SPI1, ADS_COMMAND_RDATA);
    SET_BIT(SPI1->CR2, SPI_CR2_TXEIE | SPI_CR2_ERRIE);

//    LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_3);
//    LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_2);

    LL_SPI_Enable(SPI1);  // 开始传输
    return 0;
}
#endif

static void ads_send_rdata_command_cplt_callback(void){
#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
    uint32_t _dma_isr = 0, _dma_ie = 0;
    uint32_t _dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_3]);
    _dma_isr = DMA1->ISR;
    _dma_ie = ((DMA_Channel_TypeDef *)(_dma_ch))->CCR;
//	if(LL_DMA_IsActiveFlag_TC3(DMA1)){   // TX Complete
    if((_dma_isr & DMA_ISR_TCIF3) && (_dma_ie & DMA_CCR_TCIE)){
		LL_DMA_ClearFlag_GI3(DMA1);
//		LL_DMA_ClearFlag_TC3(DMA1);
		if(ads_index >= ADS_CNT){
			LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_3);
			LL_SPI_DisableDMAReq_TX(SPI1);
//			ads_drdy_exti_enable();
		}else{
//			ads_drdy_exti_disable();
		}
	}
//	if(LL_DMA_IsActiveFlag_TE3(DMA1)){
	if((_dma_isr & DMA_ISR_TEIF3) && (_dma_ie & DMA_CCR_TEIE)){
		LL_DMA_ClearFlag_TE3(DMA1);
	}

#endif
#if(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)
	uint32_t _sr = SPI1->SR;
	uint32_t _it = SPI1->CR2;
	uint32_t _timeout = 4000000;
	uint32_t _flag = 0;
	if(((_sr & SPI_SR_OVR) == 0) && (_sr & SPI_SR_RXNE) && (_it & SPI_CR2_RXNEIE)){
        CLEAR_BIT(SPI1->CR2, SPI_CR2_RXNEIE);
	}
	LL_SPI_IsActiveFlag_TXE(SPI1);
	if((_sr & SPI_SR_TXE) && (_it & SPI_CR2_TXEIE)){
//        LL_SPI_DisableIT_TXE(SPI1);
		CLEAR_BIT(SPI1->CR2, (SPI_CR2_TXEIE | SPI_CR2_ERRIE));
        _flag = LL_SPI_GetTxFIFOLevel(SPI1);
        while(_flag && (_timeout--)){
        	_flag = READ_BIT(SPI1->SR, SPI_SR_FTLVL);
        }
        _flag = LL_SPI_IsActiveFlag_BSY(SPI1);
        while(_flag && (_timeout--)){
        	_flag = READ_BIT(SPI1->SR, SPI_SR_BSY);
        }
        _flag = LL_SPI_GetRxFIFOLevel(SPI1);
        while(_flag && (_timeout--)){
        	READ_REG(*((__IO uint8_t *)&SPI1->DR));
        	_flag = READ_BIT(SPI1->SR, SPI_SR_FRLVL);
        }
        if(LL_SPI_IsEnabled(SPI1)) LL_SPI_Disable(SPI1);

        LL_SPI_EnableDMAReq_RX(SPI1);

        st_irq_handler_register(DMA1_Channel2_IRQn, ads_read_data_cplt_callback);
        st_irq_handler_register(DMA1_Channel3_IRQn, ads_read_data_cplt_callback);
        ads_start_receive_data(ads_rdata_buffer, (ADS_DMA_TS));
	}
#endif
}


static void ads_data_ready_callback(void){
	if((LL_GPIO_ReadInputPort(EXTI_DRDY_GPIO_Port) & EXTI_DRDY_Pin) == 0){  // 低电平
		ads_drdy_count += 1;
	    if((ads_conver_control) && (ads_drdy_count % ads_conver_control)) return;

		if(ads_data_index <= 8){// 第一个数据打时间戳
			st_rtc_get_time((struct tm*)&ads_data_timestamp);
	        ads_data_buf.timestamp = ((uint32_t)((ads_data_timestamp.tm_year + 1900) - 2020) << 26) | ((uint32_t)ads_data_timestamp.tm_mon << 22) |
	    			((uint32_t)ads_data_timestamp.tm_mday << 17) |
					((uint32_t)ads_data_timestamp.tm_hour << 12) | ((uint32_t)ads_data_timestamp.tm_min << 6) | (ads_data_timestamp.tm_sec);
//	        ads_user_buf.timestamp = ads_data_buf.timestamp;
	        ads_data_buf.index += 1;
		}
	    if((!(ads_read_status & ADS_READING))){
	    	ads_read_status |= (ADS_READING);
	    	ads_read_status &= (~ADS_READ_COMPLETE);
	    	ads_bsp_selete_cs_by_index(0);
	        ads_start_receive_data(ads_rdata_buffer, (ADS_DMA_TS));
	    }
	}
}

void ads_register_drdy_callback(void *callback_function){
	st_exti_irq_handler_register(EXTI_DRDY_EXTI_IRQn, 7, callback_function);
}


uint8_t ads_read_data_by_dma_init(uint8_t *tx_ptr, uint8_t *rx_ptr, uint16_t in_size){
	uint8_t ret = 0;
#if(ADS_TX_RX_IN_ONE)

	uint32_t _rxdma_mode = (ADS_RXDMA_MODE_CIRCULAR) ? (LL_DMA_MODE_CIRCULAR | DMA_CCR_HTIE) : LL_DMA_MODE_NORMAL;
	uint32_t _txdma_mode = (ADS_TXDMA_MODE_CIRCULAR) ? (LL_DMA_MODE_CIRCULAR | DMA_CCR_HTIE) : LL_DMA_MODE_NORMAL;
    uint16_t _size = 0;

    memset((uint8_t*)ads_data_buffer, 0, sizeof(ads_data_buffer));
    memset((uint8_t*)ads_data_buffer2, 0, sizeof(ads_data_buffer2));
    memset(ads_rdata_comm, 0, sizeof(ads_rdata_comm));

#if(ADS_TIMESTAMP)
	data_ptr = &ads_data_buffer[ADS_DATA_INDEX_SIZE];
	user_ptr = &ads_data_buffer2[ADS_DATA_INDEX_SIZE];
	ads_data_index = 0;
#else
	data_ptr = ads_data_buffer;
	user_ptr = ads_data_buffer2;
	ads_data_index = 8;
#endif

	ads_index = 0;
	ads_user_fild = 0;
	ads_read_status = 0;
	ads_data_buf.data = ads_data_buffer;
	ads_data_buf.data_size = ADS_DATA_BUFFER_SIZE;
	ads_user_buf.data = ads_data_buffer2;
	ads_user_buf.data_size = ADS_DATA_BUFFER_SIZE;

    // 注册读取数据回调函数
    st_exti_irq_handler_register(EXTI_DRDY_EXTI_IRQn, 7, ads_data_ready_callback);

