XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
#if(ADS_READ_DATA_IN_COMMAND)
    if(in_size)
    	_size = in_size;
    else
    	_size = ADS_DMA_TS + 1;
    ads_rdata_comm[0] = ADS_COMMAND_RDATA;
#if(ADS_RXDMA_MODE_CIRCULAR && ADS_TXDMA_MODE_CIRCULAR)
    ads_rdata_comm[_size + 1] = ADS_COMMAND_RDATA;
    _size *= 2;
#endif
#else
    _size = ADS_DMA_TS;
#endif

    LL_SPI_Disable(SPI1);
    LL_SPI_DisableDMAReq_RX(SPI1);
    LL_SPI_DisableDMAReq_TX(SPI1);
    CLEAR_BIT(SPI1->CR2, SPI_CR2_TXEIE | SPI_CR2_RXNEIE);
    LL_SPI_SetRxFIFOThreshold(SPI1, LL_SPI_RX_FIFO_TH_QUARTER);

    st_irq_handler_register(DMA1_Channel2_IRQn, ads_read_data_cplt_callback);  // RX
    st_irq_handler_register(DMA1_Channel3_IRQn, ads_send_rdata_command_cplt_callback);  // TX
    st_irq_handler_register(SPI1_IRQn, ads_spi_irq_handler);

	if(!LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1)) LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);
	uint32_t _dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_2]);
	NVIC_EnableIRQ(DMA1_Channel2_IRQn);
	// RX
	CLEAR_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
	LL_DMA_ClearFlag_GI2(DMA1);
    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CPAR, LL_SPI_DMA_GetRegAddr(SPI1)); // 源地址
    if(rx_ptr == NULL)
    	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)ads_rdata_buffer);  // 目的地址
    else
    	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)rx_ptr);  // 目的地址
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, _size);

	LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_2, LL_DMA_REQUEST_1);
//	uint32_t _dma_csl = ((uint32_t)((uint32_t)DMA1 + DMA_CSELR_OFFSET));
//	WRITE_REG(((DMA_Request_TypeDef *)(_dma_csl))->CSELR, (LL_DMA_REQUEST_1 << POSITION_VAL(DMA_CSELR_C1S << (LL_DMA_CHANNEL_2 << 2))));
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CCR,
			LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
			LL_DMA_PRIORITY_VERYHIGH  |
			_rxdma_mode               |
			LL_DMA_PERIPH_NOINCREMENT |
			LL_DMA_MEMORY_INCREMENT   |
			LL_DMA_PDATAALIGN_BYTE    |
			LL_DMA_MDATAALIGN_BYTE    |
			DMA_CCR_TCIE              |
			DMA_CCR_TEIE              );

    // TX
	_dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_3]);
	NVIC_EnableIRQ(DMA1_Channel3_IRQn);
	CLEAR_BIT(((DMA_Channel_TypeDef *)(_dma_ch))->CCR, DMA_CCR_EN);
	LL_DMA_ClearFlag_GI3(DMA1);
    WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CPAR, LL_SPI_DMA_GetRegAddr(SPI1)); // 目的地址
    if(tx_ptr == NULL)
    	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)ads_rdata_comm);    // 源地址
    else
    	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CMAR, (uint32_t)tx_ptr);    // 源地址
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CNDTR, _size);

//	_dma_csl = ((uint32_t)((uint32_t)DMA1 + DMA_CSELR_OFFSET));
	LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_3, LL_DMA_REQUEST_1);
//	WRITE_REG(((DMA_Request_TypeDef *)(_dma_csl))->CSELR, (LL_DMA_REQUEST_1 << POSITION_VAL(DMA_CSELR_C1S << (LL_DMA_CHANNEL_3 << 2))));
	WRITE_REG(((DMA_Channel_TypeDef *)(_dma_ch))->CCR,
			LL_DMA_DIRECTION_MEMORY_TO_PERIPH |
			LL_DMA_PRIORITY_VERYHIGH  |
			_txdma_mode                 |
			LL_DMA_PERIPH_NOINCREMENT |
			LL_DMA_MEMORY_INCREMENT   |
			LL_DMA_PDATAALIGN_BYTE    |
			LL_DMA_MDATAALIGN_BYTE    |
			DMA_CCR_TCIE              |
			DMA_CCR_TEIE              );

#else
	data_ptr = ads_data_buffer;
	user_ptr = ads_data_buffer2;

	memset((uint8_t*)ads_rdata_comm, 0, sizeof(ads_rdata_comm));
	ads_rdata_comm[0] = ADS_COMMAND_RDATA;   // 读取数据命令

    LL_SPI_Disable(SPI1);

	// 配置 DMA 读, 接受数据
    _spi1_rx_dma_config((uint8_t*)ads_rdata_buffer, ADS_DMA_TS);

	// 配置 DMA 写, 发读数据命令
    _spi1_tx_dma_config((uint8_t*)ads_rdata_comm, 1);

    ads_only_rx_fild = 1;
#endif
	return ret;
}

uint8_t ads_get_read_status(void){
    return ads_read_status;
}


void ads_stop_read_data_by_dma(void){
	LL_SPI_Disable(SPI1);
	LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_2);
	LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_3);
	ads_only_rx_fild = 0;
}

uint8_t ads_data_is_buffer_full(void){
    return (ads_data_ready & ADS_DATA_BUF_FULL);
}

uint8_t ads_user_read_fild(uint8_t in_fild){
	ads_user_fild = in_fild;
	return ads_user_fild;
}

uint8_t ads_save_data_to_file(void* in_file, void* in_parma){
    uint8_t ret = 1;
    FIL *_fil_ptr = NULL;

    _fil_ptr = (FIL*)in_file;

    if(!ads_data_is_buffer_full()) return 255;
    if(_fil_ptr->obj.fs == NULL) return FR_INVALID_OBJECT;
    ads_user_fild = 0x01;

    if(*(uint8_t*)in_parma){     // 保存成 bin
#if(ADS_TIMESTAMP)
    	uint8_t _t[ADS_DATA_INDEX_SIZE] = {0};
    	*(uint32_t *)_t = ads_user_buf.timestamp;
    	*(uint32_t *)&_t[ADS_DATA_INDEX_SIZE >> 1] = _save_times;
    	ret = f_write(_fil_ptr, _t, sizeof(_t), NULL);
    	ret = f_write(_fil_ptr, (uint8_t*)user_ptr, ads_data_length, NULL);
#else
    	*(uint32_t *)&user_ptr[0] = ads_user_buf.timestamp;
    	*(uint32_t *)&user_ptr[4] = ads_user_buf.index;
    	ret = f_write(_fil_ptr, (uint8_t*)user_ptr, ads_data_length, NULL);
#endif
    }else{                       // 保存成 txt
#define TXT_BUFF_SIZE          2048
    	char _ascii_txt[TXT_BUFF_SIZE + 1];
    	uint8_t *ptr = &user_ptr[0];
    	uint32_t len = 0, ads_len = ads_data_length, data_size = 0;
    	len = data_to_str(ptr, 8, _ascii_txt, TXT_BUFF_SIZE + 1);
    	ret = f_write(_fil_ptr, _ascii_txt, len, NULL);
    	ads_len -= 8;
        ptr += 8;
        do{
            if(ads_len >= (TXT_BUFF_SIZE >> 1)){
            	data_size = (TXT_BUFF_SIZE >> 1);
                ads_len -= (TXT_BUFF_SIZE >> 1);
            }else{
            	data_size = ads_len;
                ads_len -= ads_len;
            }
            len = data_to_str(ptr, data_size, _ascii_txt, TXT_BUFF_SIZE + 1);  // HEX----->TXT: 一个数据占两个字节
            ptr += data_size;          // 偏移数据地址
            ret = f_write(_fil_ptr, _ascii_txt, len, NULL);
        }while(ads_len);
#undef TXT_BUFF_SIZE
    }
fatfs_sync_section:
    if(ads_data_ready & ADS_DATA_BUF_FULL) ads_data_ready &= (~ADS_DATA_BUF_FULL);   // 清除缓存区状态
    ads_user_fild = 0x00;
    ret = f_sync(_fil_ptr);

    return ret;
}


