XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
uint8_t* get_ads_data_buffer(void){
    if(ads_data_ready & ADS_DATA_BUF_FULL){  // 缓冲数据可用
    	return (uint8_t*)user_ptr;
    }
    return NULL;
}

static void ads_lptim2_handler(void){
	if(LL_LPTIM_IsActiveFlag_ARRM(LPTIM2)){
		LL_LPTIM_ClearFLAG_ARRM(LPTIM2);
		ADS_Start_Convert();
		NVIC_DisableIRQ(LPTIM2_IRQn);
	}
}

void ads_bsp_pin_start(void){
    uint32_t _ft = 0, _lt = 1;
    st_irq_handler_register(LPTIM2_IRQn, ads_lptim2_handler);
    if(LL_LPTIM_IsActiveFlag_ARRM(LPTIM2)) LL_LPTIM_ClearFLAG_ARRM(LPTIM2);
    _ft = _lt = HAL_GetTick();
    while((LL_LPTIM_IsActiveFlag_ARRM(LPTIM2) == 0) && ((_ft - _lt) < 3000)){
    	_lt = HAL_GetTick();
    }
    ADS_Start_Convert();
//    NVIC_EnableIRQ(LPTIM2_IRQn);
    while(LL_GPIO_IsOutputPinSet(ADS_START_GPIO_Port, ADS_START_Pin) != SET){
    	__NOP();
    }
    st_irq_handler_register(LPTIM2_IRQn, NULL);
}

void ads_bsp_pin_stop(void){
	ADS_Stop_Convert();
}

void ads_bsp_selete_cs_by_index(uint8_t in_index){
    switch(in_index){
    case 0:
    	LL_GPIO_ResetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    case 1:
    	LL_GPIO_SetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    default:
    	LL_GPIO_ResetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    }
}


void ads_bsp_power(uint8_t in_status){
	if(in_status == SET){
		V5_ON();
	}else{
		V5_OFF();
	}
}

static void ads_cal_data_ready_callback(void){
	if((LL_GPIO_ReadInputPort(EXTI_DRDY_GPIO_Port) & EXTI_DRDY_Pin) == 0){    // 低电平
	    if((!(ads_read_status & ADS_READING)) && (!ads_index)){
	    	ads_read_status |= (ADS_READING);
	    	ads_bsp_selete_cs_by_index(0);
	        ads_start_receive_data(ads_rdata_buffer, (ADS_DMA_TS));
	    }
	}
}

static void ads_cal_data_cplt_callback(void){
    uint32_t _dma_isr = 0, _dma_ie = 0;
    uint32_t _dma_ch = (uint32_t)DMA1 + (uint32_t)(CHANNEL_OFFSET_TAB[LL_DMA_CHANNEL_2]);
    _dma_isr = DMA1->ISR;
    _dma_ie = ((DMA_Channel_TypeDef *)(_dma_ch))->CCR;
#if(ADS_TX_RX_IN_ONE)
   // RX Complete
    if((_dma_isr & DMA_ISR_TCIF2) && (_dma_ie & DMA_CCR_TCIE)){
		LL_DMA_ClearFlag_GI2(DMA1);
		ads_index += 1;
#if(ADS_CONNECT_MODE == ADS_CASCADED_MODE)
        // 读取第二个通道
		if(ads_index < ADS_CNT){
			_waitfor_spi1_rxcplt();
			LL_SPI_DisableDMAReq_RX(SPI1);
			LL_SPI_Disable(SPI1);
			ads_bsp_selete_cs_by_index(ads_index);
#if(ADS_READ_DATA_IN_COMMAND)
			memcpy(&ads_data_buffer[ads_data_index], &ads_rdata_buffer[1], 3);      // 通道1
			ads_start_receive_data(ads_rdata_buffer, (ADS_DMA_TS));
#else
			memcpy((uint8_t*)&ads_data_buffer[ads_data_index], &ads_rdata_buffer[0], 3);
			ads_start_receive_data(ads_rdata_buffer, (ADS_DMA_TS));
#endif
		}
		if(ads_index == ADS_CNT){   // 所有通道读取完成
			ads_index = 0;
			LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_2);
			LL_SPI_DisableDMAReq_RX(SPI1);
			_waitfor_spi1_alldone();
			LL_SPI_Disable(SPI1);
			ads_read_status &= (~ADS_READING);
#if(ADS_READ_DATA_IN_COMMAND)
			memcpy(&ads_data_buffer2[ads_data_index], &ads_rdata_buffer[1], 3);    // 通道2
			ads_data_index += 3;
			if(ads_data_index == (3 << 13)){
				ads_drdy_exti_disable();
				ads_data_ready |= ADS_DATA_BUF_FULL;
			}
#else
			memcpy((uint8_t*)&ads_data_buffer2[ads_data_index], &ads_rdata_buffer[0], 3);
			ads_data_index += 3;
			if(ads_data_index == (3 << 13)){
				ads_drdy_exti_disable();
				ads_data_ready |= ADS_DATA_BUF_FULL;
			}
#endif
		}
#elif(ADS_CONNECT_MODE == ADS_DAISYCHAIN_MODE)

#endif
	}
	if((_dma_isr & DMA_ISR_TEIF2) && (_dma_ie & DMA_CCR_TEIE)){
		LL_DMA_ClearFlag_TE2(DMA1);
	}

#endif
}
uint8_t ads_bsp_calibrate(uint32_t *out_cal_value, uint8_t in_size){
	uint8_t ret = 0;
    uint32_t cal_complements[ADS_CNT] = { 0 };
    uint32_t i = 0;

    if((cal_complements != NULL)){
    	ads_data_index = 0;
        ads_read_data_by_dma_init(ads_rdata_comm, ads_rdata_buffer, 0);
        st_exti_irq_handler_register(EXTI_DRDY_EXTI_IRQn, 7, ads_cal_data_ready_callback);
        st_irq_handler_register(DMA1_Channel2_IRQn, ads_cal_data_cplt_callback);  // RX
        st_irq_handler_register(DMA1_Channel3_IRQn, ads_send_rdata_command_cplt_callback);  // TX
        st_irq_handler_register(SPI1_IRQn, ads_spi_irq_handler);
    	ads_bsp_pin_start();
		while(ads_data_is_buffer_full() == 0){
			__NOP();
		}
		ads_bsp_pin_stop();
		st_exti_irq_handler_register(EXTI_DRDY_EXTI_IRQn, 7, NULL);
//		spi_set_clk_div(SPI1, LL_SPI_BAUDRATEPRESCALER_DIV256);  // 低速读取设备配置
		i = 0;
        do{
        	cal_complements[0] += ((ads_data_buffer[i] << 16) | (ads_data_buffer[i + 1] << 8) | (ads_data_buffer[i + 2]));
            i += 3;
        }while(i < ads_data_index);
        i = 0;
        do{
        	cal_complements[1] += ((ads_data_buffer2[i] << 16) | (ads_data_buffer2[i + 1] << 8) | (ads_data_buffer2[i + 2]));
            i += 3;
        }while(i < ads_data_index);
        cal_complements[0] >>= 13;
        cal_complements[1] >>= 13;
//        i = 0;
//        do{
//      	    ads_bsp_selete_cs_by_index(i, RESET);
//      	    ads_cfg_sys_offset_calibration(cal_complements[i]);
//            i += 1;
//        }while(i < ADS_CNT);
        if(out_cal_value != NULL){
        	out_cal_value[0] = cal_complements[0];
        	out_cal_value[1] = cal_complements[1];
        }
        ads_data_index = 0;
    }
    return ret;
}


#else

extern ads_drv_t ads_drv;
static void _ads_delay(uint32_t _delay){
	HAL_Delay(_delay);
}

void ads_drv_init(ads_write_func_t write_func, ads_read_func_t read_func, ads_write_read_func_t wr_func){

    if(write_func != NULL){
    	ads_drv.write = write_func;
    }else{
    	return;
    }
    if(read_func != NULL){
    	ads_drv.read = read_func;
    }else{
    	return;
    }
    if(wr_func != NULL){
    	ads_drv.write_read = wr_func;
    }
    ads_drv.delay = _ads_delay;
}


static uint8_t rdata_buffer[8] = {0};


void ads_bsp_pin_stop(void){
	ADS_Stop_Convert();
}
void ads_bsp_pin_start(void){
	if(LL_LPTIM_IsActiveFlag_ARRM(LPTIM2)) LL_LPTIM_ClearFLAG_ARRM(LPTIM2);
    while(LL_LPTIM_IsActiveFlag_ARRM(LPTIM2) != SET);
    ADS_Start_Convert();
    while(LL_GPIO_IsOutputPinSet(ADS_START_GPIO_Port, ADS_START_Pin) != SET){
    	__NOP();
    }
}
void ads_bsp_power(uint8_t in_status){
	if(in_status == SET){
		V5_ON();
	}else{
		V5_OFF();
	}
}

