XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
void ads_set_conver_rate(uint32_t rate, uint16_t osr){

    uint32_t clk = 0;

	if((rate * osr) <= 100000){   // 不满足最低 100KHz
		if(rate * osr == 0){
		    clk = 0;   // 关闭采样时钟
		}else{
			clk = 128000;   // 采样主时钟  >=100KHz
		}
	}else clk = rate * osr;

	lptim2_use_for_ads_clk(clk);    // 设置采样时钟频率

//    if(ads_config.conver_rate < (clk / ads_config.osr)){  // 采样率小于最小值, 设定最小采样率, 间隔取采样值
////        ads_conver_control = (clk / ads_config.osr / ads_config.conver_rate) + 1;
//    }else{
////    	ads_conver_control = 0;
//    }

//	ads_drdy_count = 0;
}

void ads_bsp_selete_cs_by_index(uint8_t in_index){
    switch(in_index){
    case 0:
    	LL_GPIO_ResetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    case 1:
    	LL_GPIO_SetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    default:
    	LL_GPIO_ResetOutputPin(ADS_CS_GPIO_Port, ADS_CS_Pin);
    	break;
    }
}


static void spi1_irq_handler(void){
	uint32_t _sr = 0, _cr2 = 0;
	_sr = SPI1->SR;
	_cr2 = SPI1->CR2;

	if((_sr & SPI_SR_TXE) && (_cr2 & SPI_CR2_TXEIE)){

	}
	if(!(_sr & SPI_SR_OVR) && (_sr & SPI_SR_RXNE) && (_cr2 & SPI_CR2_RXNEIE)){

	}
	if((_cr2 & SPI_CR2_ERRIE) && ((_sr & SPI_SR_MODF) || (_sr & SPI_SR_OVR) || (_sr & SPI_SR_FRE))){
		if(_sr & SPI_SR_MODF){
			spi_internal_slave_selete(SPI1, SET);
            LL_SPI_ClearFlag_MODF(SPI1);
		}
		if(_sr & SPI_SR_OVR){
            LL_SPI_ClearFlag_OVR(SPI1);
		}
		if(_sr & SPI_SR_FRE){
            LL_SPI_ClearFlag_FRE(SPI1);
		}
	}
}

static void spi1_tx_dma_irq_handler(void){

}

static uint8_t _index = 0;
static void spi1_rx_dma_irq_handler(void){
    if(LL_DMA_IsActiveFlag_HT2(DMA1)){
//    	LL_SPI_Disable(SPI1);
//    	ads_bsp_selete_cs_by_index(1);
    	LL_DMA_ClearFlag_HT2(DMA1);
//    	READ_REG(*((__IO uint16_t *)&SPI1->DR));
//    	LL_SPI_Enable(SPI1);
    }
    if(LL_DMA_IsActiveFlag_TC2(DMA1)){
    	LL_SPI_Disable(SPI1);
    	LL_DMA_ClearFlag_GI2(DMA1);
    	_index += 1;
		uint8_t tmp[8];
		memcpy(tmp, rdata_buffer, 4);
    	if(_index == 1){
        	ads_bsp_selete_cs_by_index(1);
        	LL_DMA_ClearFlag_GI2(DMA1);
        	LL_SPI_Enable(SPI1);
    	}

//    	uint8_t tmp[8];
//    	memcpy(tmp, rdata_buffer, 4);
//    	READ_REG(*((__IO uint16_t *)&SPI1->DR));
//    	memset(rdata_buffer, 0, 8);
    }
}

static void ads_drdy_irq_handler(void){
	if((LL_GPIO_ReadInputPort(EXTI_DRDY_GPIO_Port) & EXTI_DRDY_Pin) == 0){
		ads_bsp_selete_cs_by_index(0);
		READ_REG(*((__IO uint16_t *)&SPI1->DR));  // 清空
		_index = 0;

        LL_SPI_Enable(SPI1);
	}
}

static void _spi1_tx_dma_config(uint8_t *ptr, uint16_t _s){  // DMA1 Channel3; Request 1

	/* (1) Enable the clock of DMA1 and DMA1 */
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);

	/* (2) Configure NVIC for DMA transfer complete/error interrupts */

	NVIC_EnableIRQ(DMA1_Channel3_IRQn);

	LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_3);
	LL_DMA_ClearFlag_GI3(DMA1);
	/* (3) Configure the DMA1_Channel2 functional parameters */
	LL_DMA_ConfigTransfer(DMA1, LL_DMA_CHANNEL_3,
			            LL_DMA_DIRECTION_MEMORY_TO_PERIPH |
						LL_DMA_PRIORITY_HIGH |
						LL_DMA_MODE_NORMAL |
						LL_DMA_PERIPH_NOINCREMENT |
						LL_DMA_MEMORY_INCREMENT |
						LL_DMA_PDATAALIGN_BYTE |
						LL_DMA_MDATAALIGN_BYTE);

	LL_DMA_ConfigAddresses(DMA1, LL_DMA_CHANNEL_3,
			(uint32_t)ptr,  // 源地址
			LL_SPI_DMA_GetRegAddr(SPI1),                // 目的地址
			LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
	LL_DMA_SetDataLength(DMA1, LL_DMA_CHANNEL_3, _s);


	if(LL_DMA_GetPeriphRequest(DMA1, LL_DMA_CHANNEL_3) != LL_DMA_REQUEST_1)
		LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_3, LL_DMA_REQUEST_1);

	/* (5) Enable DMA interrupts complete/error */
	LL_DMA_EnableIT_TC(DMA1, LL_DMA_CHANNEL_3);
	LL_DMA_EnableIT_TE(DMA1, LL_DMA_CHANNEL_3);

	LL_DMA_EnableChannel(DMA1, LL_DMA_CHANNEL_3);
}

static void _spi1_rx_dma_config(uint8_t *ptr, uint16_t _s){   // DMA1 Channel2; Request 1
	/* (1) Enable the clock of DMA1 and DMA1 */
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);

	/* (2) Configure NVIC for DMA transfer complete/error interrupts */
	NVIC_EnableIRQ(DMA1_Channel2_IRQn);
	LL_DMA_DisableChannel(DMA1, LL_DMA_CHANNEL_2);

	LL_DMA_ClearFlag_GI2(DMA1);
	/* (3) Configure the DMA1_Channel2 functional parameters */
	LL_DMA_ConfigTransfer(DMA1, LL_DMA_CHANNEL_2,
			            LL_DMA_DIRECTION_PERIPH_TO_MEMORY |
						LL_DMA_PRIORITY_HIGH |
						LL_DMA_MODE_CIRCULAR |
						LL_DMA_PERIPH_NOINCREMENT |
						LL_DMA_MEMORY_INCREMENT |
						LL_DMA_PDATAALIGN_BYTE |
						LL_DMA_MDATAALIGN_BYTE);

	LL_DMA_ConfigAddresses(DMA1, LL_DMA_CHANNEL_2,
			LL_SPI_DMA_GetRegAddr(SPI1),  // 源地址
			(uint32_t)ptr,                // 目的地址
			LL_DMA_DIRECTION_PERIPH_TO_MEMORY);

	LL_DMA_SetDataLength(DMA1, LL_DMA_CHANNEL_2, _s);

	if(LL_DMA_GetPeriphRequest(DMA1, LL_DMA_CHANNEL_2) != LL_DMA_REQUEST_1)
		LL_DMA_SetPeriphRequest(DMA1, LL_DMA_CHANNEL_2, LL_DMA_REQUEST_1);

	/* (5) Enable DMA interrupts complete/error */

	LL_DMA_EnableIT_HT(DMA1, LL_DMA_CHANNEL_2);
	LL_DMA_EnableIT_TC(DMA1, LL_DMA_CHANNEL_2);
	LL_DMA_EnableIT_TE(DMA1, LL_DMA_CHANNEL_2);

	LL_DMA_EnableChannel(DMA1,  LL_DMA_CHANNEL_2);
}


void ads_config_spi_init(void){
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

    LL_SPI_DeInit(SPI1);

	LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_3 | LL_GPIO_PIN_4 | LL_GPIO_PIN_5;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
	GPIO_InitStruct.Alternate = LL_GPIO_AF_5;
	LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);

	/* Configure SPI1 communication */
	LL_SPI_SetBaudRatePrescaler(SPI1, LL_SPI_BAUDRATEPRESCALER_DIV8); // 时钟分频, spi时钟频率 = PCLK2 / baudrate_presacler;
	LL_SPI_SetTransferDirection(SPI1,LL_SPI_FULL_DUPLEX);   // 全双工
	LL_SPI_SetClockPhase(SPI1, LL_SPI_PHASE_2EDGE);         // 相位
	LL_SPI_SetClockPolarity(SPI1, LL_SPI_POLARITY_LOW);     // 极性
	/* Reset value is LL_SPI_MSB_FIRST */
	LL_SPI_SetTransferBitOrder(SPI1, LL_SPI_MSB_FIRST);     // 高位先出
	LL_SPI_SetDataWidth(SPI1, LL_SPI_DATAWIDTH_8BIT);       // 数据宽度 8bit
	LL_SPI_SetNSSMode(SPI1, LL_SPI_NSS_SOFT);               // 软件片选
	LL_SPI_SetRxFIFOThreshold(SPI1, LL_SPI_RX_FIFO_TH_QUARTER);  //8bit
	LL_SPI_SetMode(SPI1, LL_SPI_MODE_MASTER);               // 主机
	LL_SPI_DisableCRC(SPI1);
//	LL_SPI_Enable(SPI1);

	HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
	HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);

	LL_SPI_EnableIT_ERR(SPI1);
	st_irq_handler_register(SPI1_IRQn, spi1_irq_handler);
}



void ads_rdata_spi_init(void){
	LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

