XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/components/ads127/bsp_ads127.c
    LL_SPI_DeInit(SPI1);

	LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_3 | LL_GPIO_PIN_4 | LL_GPIO_PIN_5;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
	GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
	GPIO_InitStruct.Alternate = LL_GPIO_AF_5;
	LL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1);

	/* Configure SPI1 communication */
	LL_SPI_SetBaudRatePrescaler(SPI1, LL_SPI_BAUDRATEPRESCALER_DIV8); // 时钟分频, spi时钟频率 = PCLK2 / baudrate_presacler;
	LL_SPI_SetTransferDirection(SPI1,LL_SPI_SIMPLEX_RX);   // Only Rx
	LL_SPI_SetClockPhase(SPI1, LL_SPI_PHASE_2EDGE);         // 相位
	LL_SPI_SetClockPolarity(SPI1, LL_SPI_POLARITY_LOW);     // 极性
	/* Reset value is LL_SPI_MSB_FIRST */
	LL_SPI_SetTransferBitOrder(SPI1, LL_SPI_MSB_FIRST);     // 高位先出
	LL_SPI_SetDataWidth(SPI1, LL_SPI_DATAWIDTH_8BIT);       // 数据宽度 8bit
	LL_SPI_SetNSSMode(SPI1, LL_SPI_NSS_SOFT);               // 软件片选
	LL_SPI_SetRxFIFOThreshold(SPI1, LL_SPI_RX_FIFO_TH_QUARTER);  //8bit
	LL_SPI_SetMode(SPI1, LL_SPI_MODE_MASTER);               // 主机
	LL_SPI_DisableCRC(SPI1);

	LL_SPI_EnableDMAReq_RX(SPI1);

	HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
	HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);

	LL_SPI_EnableIT_ERR(SPI1);
	st_irq_handler_register(SPI1_IRQn, spi1_irq_handler);
}

uint8_t ads_read_data_by_dma_init(uint8_t *tx_ptr, uint8_t *rx_ptr, uint16_t in_size){

	ads_rdata_spi_init();

    st_exti_irq_handler_register(EXTI_DRDY_EXTI_IRQn, 7, ads_drdy_irq_handler);
    st_irq_handler_register(DMA1_Channel2_IRQn, spi1_rx_dma_irq_handler);  // RX
    st_irq_handler_register(DMA1_Channel3_IRQn, spi1_tx_dma_irq_handler);



    _spi1_rx_dma_config(rdata_buffer, 4);
	return 0;
}

uint8_t ads_save_data_to_file(void* in_file, void* in_parma){

	return 1;
}

#endif
